podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/C_CAN_LPC11xx.svd.xml
            <register>
               <name>CANTEST</name>
               <description>Test register</description>
               <addressOffset>0x14</addressOffset>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>BASIC</name>
                     <description>Basic mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>BASIC_MODE_DISABLED_</name>
                           <description>Basic mode disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXRX</name>
                           <description>IF1 registers used as TX buffer, IF2 registers used as RX buffer</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SILENT</name>
                     <description>Silent mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NORMAL_OPERATION_</name>
                           <description>Normal operation</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SILENT</name>
                           <description>The module is in silent mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LBACK</name>
                     <description>Loop back mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>Loop back mode is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>Loop back mode is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TX</name>
                     <description>Control of CAN_TXD pins</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>LEVEL</name>
                           <description>Level at the CAN_TXD pin is controlled by the CAN controller. This is the value at reset</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TXD</name>
                           <description>The sample point can be monitored at the CAN_TXD pin</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>CAN_TXD pin is driven LOW/dominant</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>CAN_TXD pin is driven HIGH/recessive</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RX</name>
                     <description>Monitors the actual value of the CAN_RXD pin</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RECESSIVE</name>
                           <description>The CAN bus is recessive (CAN_RXD = 1)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DORMANT</name>
                           <description>The CAN bus is dominant (CAN_RXD = 0)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANBRPE</name>
               <description>Baud rate prescaler extension register</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>BRPE</name>
                     <description>Baud rate prescaler extension By programming BRPE the Baud Rate Prescaler can be extended to values up to 1023. Hardware interprets the value as the value of BRPE (MSBs) and BRP (LSBs) plus one. Allowed values are 0 to 15</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_CMDREQ</name>
               <description>Message interface  command request</description>
               <addressOffset>0x20</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>MN</name>
                     <description>Message number 0x01 - 0x20 = Valid message numbers. The message object in the message RAM is selected for data transfer. 0x00 = Not a valid message number. This value is interpreted as 0x20.[1] 0x21 - 0x3F = Not a valid message number. This value is interpreted as 0x01 - 0x1F.[1]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>BUSY flag</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ZERO</name>
                           <description>Set to zero by hardware when read/write action to this Command request register has finished</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>Set to one by hardware when writing to this Command request register</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_CMDMSK_R</name>
               <description>Message interface  command mask - read direction</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>DATA_B</name>
                     <description>Access data bytes 4-7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNCHANGED</name>
                           <description>Data bytes 4-7 unchanged</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSFER_DATA_BYTES_</name>
                           <description>Transfer data bytes 4-7 to IFx message buffer register</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DATA_A</name>
                     <description>Access data bytes 0-3</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNCHANGED</name>
                           <description>Data bytes 0-3 unchanged</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSFER_DATA_BYTES_</name>
                           <description>Transfer data bytes 0-3 to IFx message buffer</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NEWDAT</name>
                     <description>Access new data bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNCHANGED</name>
                           <description>NEWDAT bit remains unchanged. A read access to a message object can be combined with the reset of the control bits INTPND and NEWDAT in IF1/2_MCTRL. The values of these bits transferred to the IFx Message Control Register always reflect the status before resetting these bits</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_NEWDAT_BIT_IN_</name>
                           <description>Clear NEWDAT bit in the message object</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLRINTPND</name>
                     <description>Clear interrupt pending bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNCHANGED</name>
                           <description>INTPND bit remains unchanged</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CLEAR_INTPND_BIT_IN_</name>
                           <description>Clear INTPND bit in the message object</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CTRL</name>
                     <description>Access control bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNCHANGED</name>
                           <description>Control bits unchanged</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSFER_CONTROL_BIT</name>
                           <description>Transfer control bits to IFx message buffer</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ARB</name>
                     <description>Access arbitration bits</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNCHANGED</name>
                           <description>Arbitration bits unchanged</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSFER_IDENTIFIER</name>
                           <description>Transfer Identifier, DIR, XTD, and MSGVAL bits to IFx message buffer register</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK</name>
                     <description>Access mask bits</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNCHANGED</name>
                           <description>Mask bits unchanged</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSFER_IDENTIFIER_</name>
                           <description>Transfer Identifier MASK + MDIR + MXTD to IFx message buffer register</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WR_RD</name>
                     <description>Read transfer Transfer data from the message object addressed by the command request register to the selected message buffer registers CANIFn_CMDREQ</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_CMDMSK_W</name>
               <description>Message interface 
command mask - write direction</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>DATA_B</name>
                     <description>Access data bytes 4-7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DATA_BYTES_4_7_UNCHA</name>
                           <description>Data bytes 4-7 unchanged</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSFER_DATA_BYTES_</name>
                           <description>Transfer data bytes 4-7 to message object</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DATA_A</name>
                     <description>Access data bytes 0-3</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DATA_BYTES_0_3_UNCHA</name>
                           <description>Data bytes 0-3 unchanged</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSFER_DATA_BYTES_</name>
                           <description>Transfer data bytes 0-3 to message object</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXRQST</name>
                     <description>Access transmission request bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_TRANSMISSION_REQU</name>
                           <description>No transmission request. TXRQSRT bit unchanged in IF1/2_MCTRL. If a transmission is requested by programming this bit, the TXRQST bit in the CANIFn_MCTRL register is ignored</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REQUEST_A_TRANSMISSI</name>
                           <description>Request a transmission. Set the TXRQST bit IF1/2_MCTRL</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLRINTPND</name>
                     <description>This bit is ignored in the write direction</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTRL</name>
                     <description>Access control bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNCHANGED</name>
                           <description>Control bits unchanged</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSFER_CONTROL_BIT</name>
                           <description>Transfer control bits to message object</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ARB</name>
                     <description>Access arbitration bits</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNCHANGED</name>
                           <description>Arbitration bits unchanged</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSFER_IDENTIFIER</name>
                           <description>Transfer Identifier, DIR, XTD, and MSGVAL bits to message object</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MASK</name>
                     <description>Access mask bits</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>UNCHANGED</name>
                           <description>Mask bits unchanged</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSFER_IDENTIFIER_</name>
                           <description>Transfer Identifier MASK + MDIR + MXTD to message object</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WR_RD</name>
                     <description>Write transfer Transfer data from the selected message buffer registers to the message object addressed by the command request register CANIFn_CMDREQ</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_MSK1</name>
               <description>Message interface 1 mask 1</description>
               <addressOffset>0x28</addressOffset>
               <resetValue>0xFFFF</resetValue>
               <fields>
                  <field>
                     <name>MSK_15_0</name>
                     <description>Identifier mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOINHIBIT</name>
                           <description>The corresponding bit in the identifier of the message can not inhibit the match in the acceptance filtering</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACCEPTANCEFILTERING</name>
                           <description>The corresponding identifier bit is used for acceptance filtering</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
