podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/C_CAN_LPC11xx.svd.xml
            <register>
               <name>CANIF1_MSK2</name>
               <description>Message interface 1 mask 2</description>
               <addressOffset>0x2C</addressOffset>
               <resetValue>0xFFFF</resetValue>
               <fields>
                  <field>
                     <name>MSK_28_16</name>
                     <description>Identifier mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOINHIBIT</name>
                           <description>The corresponding bit in the identifier of the message can not inhibit the match in the acceptance filtering</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACCEPTANCEFILTERING</name>
                           <description>The corresponding identifier bit is used for acceptance filtering</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MDIR</name>
                     <description>Mask message direction</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOEFFECT</name>
                           <description>The message direction bit (DIR) has no effect on acceptance filtering</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACCEPTANCEFILTERING</name>
                           <description>The message direction bit (DIR) is used for acceptance filtering</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MXTD</name>
                     <description>Mask extend identifier</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOEFFECT</name>
                           <description>The extended identifier bit (XTD) has no effect on acceptance filtering</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACCEPTANCEFILTERING</name>
                           <description>The extended identifier bit (XTD) is used for acceptance filtering</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_ARB1</name>
               <description>Message interface 1 arbitration 1</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>ID_15_0</name>
                     <description>Message identifier  29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_ARB2</name>
               <description>Message interface 1 arbitration 2</description>
               <addressOffset>0x34</addressOffset>
               <fields>
                  <field>
                     <name>ID_28_16</name>
                     <description>Message identifier  29-bit identifier (extended frame) 11-bit identifier (standard frame)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>13</bitWidth>
                  </field>
                  <field>
                     <name>DIR</name>
                     <description>Message direction</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RECEIVE</name>
                           <description>Direction = receive. On TXRQST, a Remote Frame with the identifier of this Message Object is transmitted. On reception of a Data Frame with matching identifier, that message is stored in this Message Object</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSMIT</name>
                           <description>Direction = transmit. On TXRQST, the respective Message Object is transmitted as a Data Frame. On reception of a Remote Frame with matching identifier, the TXRQST bit of this Message Object is set (if RMTEN = one)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>XTD</name>
                     <description>Extend identifier</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>11_BIT_STANDARD_</name>
                           <description>The 11-bit standard identifier will be used for this message object</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>29_BIT_EXTENDED_</name>
                           <description>The 29-bit extended identifier will be used for this message object</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MSGVAL</name>
                     <description>Message valid The CPU must reset the MSGVAL bit of all unused Messages Objects during the initialization before it resets bit INIT in the CAN Control Register. This bit must also be reset before the identifier ID28:0, the control bits XTD, DIR, or the Data Length Code DLC3:0 are modified, or if the Messages Object is no longer required</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IGNORE</name>
                           <description>The message object is ignored by the message handler</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CONFIGURED</name>
                           <description>The message object is configured and should be considered by the message handler</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_MCTRL</name>
               <description>Message interface 1 message control</description>
               <addressOffset>0x38</addressOffset>
               <fields>
                  <field>
                     <name>DLC_3_0</name>
                     <description>Data length code The Data Length Code of a Message Object must be defined the same as in all the corresponding objects with the same identifier at other nodes. When the Message Handler stores a data frame, it will write the DLC to the value given by the received message. 0000 - 1000 = Data frame has 0 - 8 data bytes. 1001 - 1111 = Data frame has 8 data bytes</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EOB</name>
                     <description>End of buffer</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FIFO</name>
                           <description>Message object belongs to a FIFO buffer and is not the last message object of that FIFO buffer</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGELAST</name>
                           <description>Single message object or last message object of a FIFO buffer</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXRQST</name>
                     <description>Transmit request</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOWAIT</name>
                           <description>This message object is not waiting for transmission</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WAIT</name>
                           <description>The transmission of this message object is requested and is not yet done</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RMTEN</name>
                     <description>Remote enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOCHANGE</name>
                           <description>At the reception of a remote frame, TXRQST is left unchanged</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET</name>
                           <description>At the reception of a remote frame, TXRQST is set</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RXIE</name>
                     <description>Receive interrupt enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOCHANGE</name>
                           <description>INTPND will be left unchanged after successful reception of a frame</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET</name>
                           <description>INTPND will be set after successful reception of a frame</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXIE</name>
                     <description>Transmit interrupt enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOCHANGE</name>
                           <description>The INTPND bit will be left unchanged after a successful transmission of a frame</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SET</name>
                           <description>INTPND will be set after a successful transmission of a frame</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UMASK</name>
                     <description>Use acceptance mask If UMASK is set to 1, the message object&apos;s mask bits have to be programmed during initialization of the message object before MAGVAL is set to 1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IGNORE</name>
                           <description>Mask ignored</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USEMASK</name>
                           <description>Use mask (MSK[28:0], MXTD, and MDIR) for acceptance filtering</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>INTPND</name>
                     <description>Interrupt pending</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOINTSOURCE</name>
                           <description>This message object is not the source of an interrupt</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTSOURCE</name>
                           <description>This message object is the source of an interrupt. The Interrupt Identifier in the Interrupt Register will point to this message object if there is no other interrupt source with higher priority</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MSGLST</name>
                     <description>Message lost (only valid for message objects in the direction receive)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NOLOST</name>
                           <description>No message lost since this bit was reset last by the CPU</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NEWMESSAGE</name>
                           <description>The Message Handler stored a new message into this object when NEWDAT was still set, the CPU has lost a message</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NEWDAT</name>
                     <description>New data</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NONEWDATA</name>
                           <description>No new data has been written into the data portion of this message object by the message handler since this flag was cleared last by the CPU</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NEWDATA</name>
                           <description>The message handler or the CPU has written new data into the data portion of this message object</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_DA1</name>
               <description>Message interface 1 data A1</description>
               <addressOffset>0x3C</addressOffset>
               <fields>
                  <field>
                     <name>DATA0</name>
                     <description>Data byte 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DATA1</name>
                     <description>Data byte 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_DA2</name>
               <description>Message interface 1 data A2</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>DATA2</name>
                     <description>Data byte 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DATA3</name>
                     <description>Data byte 3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_DB1</name>
               <description>Message interface 1 data B1</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>DATA4</name>
                     <description>Data byte 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DATA5</name>
                     <description>Data byte 5</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF1_DB2</name>
               <description>Message interface 1 data B2</description>
               <addressOffset>0x48</addressOffset>
               <fields>
                  <field>
                     <name>DATA6</name>
                     <description>Data byte 6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DATA7</name>
                     <description>Data byte 7</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CANIF2_CMDREQ</name>
               <description>Message interface  command request</description>
               <addressOffset>0x80</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>MN</name>
                     <description>Message number 0x01 - 0x20 = Valid message numbers. The message object in the message RAM is selected for data transfer. 0x00 = Not a valid message number. This value is interpreted as 0x20.[1] 0x21 - 0x3F = Not a valid message number. This value is interpreted as 0x01 - 0x1F.[1]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>BUSY flag</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>ZERO</name>
                           <description>Set to zero by hardware when read/write action to this Command request register has finished</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>Set to one by hardware when writing to this Command request register</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
